# AnalyticalConsistencyChecking Members (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
AnalyticalConsistencyChecking Members
AnalyticalConsistencyChecking Class Methods See Also
---
The AnalyticalConsistencyChecking type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CheckAnalyticalConsistency | Checks consistency of the Analytical Model. |

# See Also
AnalyticalConsistencyChecking Class
Autodesk.Revit.DB.Structure Namespace